conf_files/InformationRegisters/ПользовательскиеЗначенияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ПользовательскиеЗначенияПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

conf_files/CommonModules/ПользовательскиеЗначенияПоУмолчаниюСервер/Ext/Module.bsl
Процедура ДобавитьОтсутствующиеНастройкиПользователяВРегистр(владелецНастроек) экспорт
	
	если не ОбщегоНазначенияИнформбюроСервер.ЗначениеИмеетТип(владелецНастроек, "СправочникСсылка.Пользователи") тогда
		возврат;
	конецЕсли;	
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПользовательскиеЗначенияПоУмолчанию.Настройка КАК Настройка,
	               |	ПользовательскиеЗначенияПоУмолчанию.Значение КАК Значение
	               |ПОМЕСТИТЬ втНастройкиПользователя
	               |ИЗ
	               |	РегистрСведений.ПользовательскиеЗначенияПоУмолчанию КАК ПользовательскиеЗначенияПоУмолчанию
	               |ГДЕ
	               |	ПользовательскиеЗначенияПоУмолчанию.Пользователь = &Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиПользователей.Ссылка КАК Настройка,
	               |	НастройкиПользователей.ТипЗначения КАК ТипЗначения,
	               |	ЕСТЬNULL(втНастройкиПользователя.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	               |ИЗ
	               |	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втНастройкиПользователя КАК втНастройкиПользователя
	               |		ПО НастройкиПользователей.Ссылка = втНастройкиПользователя.Настройка
	               |ГДЕ
	               |	втНастройкиПользователя.Значение ЕСТЬ NULL";
	
	запрос.УстановитьПараметр("Пользователь", владелецНастроек);
	выбРезультатЗапроса = запрос.Выполнить().Выбрать();
	
	пока выбРезультатЗапроса.Следующий() цикл
			
		записьРегистраНастроек = РегистрыСведений.ПользовательскиеЗначенияПоУмолчанию.СоздатьМенеджерЗаписи();
	
		записьРегистраНастроек.Настройка = выбРезультатЗапроса.Настройка;
		записьРегистраНастроек.Пользователь = владелецНастроек;
		
		если выбРезультатЗапроса.ТипЗначения.Типы().Количество() = 1 тогда
			записьРегистраНастроек.Значение = ОбщегоНазначенияИнформбюроСервер.ПолучитьПустоеЗначениеПоТипу(выбРезультатЗапроса.ТипЗначения);
		иначе	
			записьРегистраНастроек.Значение = неопределено;
		конецЕсли;
		
		записьРегистраНастроек.Записать(ложь);
	
	КонецЦикла;	
	
КонецПроцедуры
